In [1]:
import pandas as pd
import numpy as np
from dateutil.parser import parse

In [23]:
# create data
df_data= pd.DataFrame({'date': ['3/10/2002', '10/02/2006', '2/09/2021', '1/1/2000'],
                    'values': [101, 50, 200, 303]})
df_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    4 non-null      object
 1   values  4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 192.0+ bytes

In [4]:
df_data.head()

         date  values
0   3/10/2002     101
1  10/02/2006      50
2   2/09/2021     200
3    1/1/2000     303

In [7]:
# convert column date to datetime
df_data['date']= pd.to_datetime(df_data['date'], dayfirst= True)
df_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    4 non-null      datetime64[ns]
 1   values  4 non-null      int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 192.0 bytes

In [8]:
df_data.head()

        date  values
0 2002-10-03     101
1 2006-02-10      50
2 2021-09-02     200
3 2000-01-01     303

In [10]:
# create another data
df_data= pd.DataFrame({'date': ['3-10-2002 23:01:11', '10-02-2006 13:20:33', '2-09-2021 11:34:23', '1-1-2000 03:25:44'],
                    'values': [101, 50, 200, 303]})
df_data['date']= pd.to_datetime(df_data['date'], format= '%d-%m-%Y %H:%M:%S', errors= 'coerce')
df_data.head()

                 date  values
0 2002-10-03 23:01:11     101
1 2006-02-10 13:20:33      50
2 2021-09-02 11:34:23     200
3 2000-01-01 03:25:44     303

In [13]:
df_data['date']= pd.to_datetime(df_data['date']).dt.strftime('%d-%m-%Y %H:%M:%S')
df_data.head()

                  date  values
0  10-03-2002 23:01:11     101
1  02-10-2006 13:20:33      50
2  09-02-2021 11:34:23     200
3  01-01-2000 03:25:44     303

In [14]:
df_data= pd.DataFrame({'year': [2002, 2009],
                    'month': [2, 5],
                    'day': [24, 12]})
df_data.head()

   year  month  day
0  2002      2   24
1  2009      5   12

In [15]:
df_data['date']= pd.to_datetime(df_data)
df_data.head()

   year  month  day       date
0  2002      2   24 2002-02-24
1  2009      5   12 2009-05-12

## 4. Get year, month, day from datetime

In [2]:
df_data= pd.DataFrame({'name': ['Hoang', 'su', 'duong', 'phuong'],
                    'dob': ['11-12-2000', '12-3-1999', '4-4-2000', '3-3-1933']})
# convert to datetime
# get year, day, month, week, day of week(Monday, ....)
# get age from dob and store in new column 'Age'
#

In [32]:
# convert to datetime
df_data['dob']= pd.to_datetime(df_data['dob'], format= '%m-%d-%Y', errors= 'coerce')
df_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   dob     4 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(1)
memory usage: 192.0+ bytes

In [4]:
# get year, day, month, week, day of week(Monday, ....)
get = lambda x: parse(x)
# get year
get_year= df_data['dob'].map(get)
print("Year:")
print(get_year.dt.year.tolist())
# get day
get_day= df_data['dob'].map(get)
print("Day:")
print(get_day.dt.day.tolist())
# get month
get_month= df_data['dob'].map(get)
print("Month:")
print(get_month.dt.month.tolist())
# get day of week
get_day_of_week= df_data['dob'].map(get)
print("Day of week:")
print(get_day_of_week.dt.day_name())

Year:
[2000, 1999, 2000, 1933]
Day:
[12, 3, 4, 3]
Month:
[11, 12, 4, 3]
Day of week:
0     Sunday
1     Friday
2    Tuesday
3     Friday
Name: dob, dtype: object